{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "encoder_conv2D1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv2D1", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "name": "elu", "inbound_nodes": [[["encoder_conv2D1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "encoder_conv2D2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv2D2", "inbound_nodes": [[["elu", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "dtype": "float32", "alpha": 1.0}, "name": "elu_1", "inbound_nodes": [[["encoder_conv2D2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "encoder_maxpool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "encoder_maxpool1", "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "encoder_conv2D3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv2D3", "inbound_nodes": [[["encoder_maxpool1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "dtype": "float32", "alpha": 1.0}, "name": "elu_2", "inbound_nodes": [[["encoder_conv2D3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [2, 2, 2, 2048]}, "name": "reshape", "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4, 4], "strides": [2, 2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["conv3d_transpose", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4, 4], "strides": [2, 2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_1", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1", "inbound_nodes": [[["conv3d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4, 4], "strides": [2, 2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_2", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["conv3d_transpose_2", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4, 4], "strides": [2, 2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_3", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["conv3d_transpose_3", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "ED", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "ED", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["ED", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of76.bin", "group1-shard2of76.bin", "group1-shard3of76.bin", "group1-shard4of76.bin", "group1-shard5of76.bin", "group1-shard6of76.bin", "group1-shard7of76.bin", "group1-shard8of76.bin", "group1-shard9of76.bin", "group1-shard10of76.bin", "group1-shard11of76.bin", "group1-shard12of76.bin", "group1-shard13of76.bin", "group1-shard14of76.bin", "group1-shard15of76.bin", "group1-shard16of76.bin", "group1-shard17of76.bin", "group1-shard18of76.bin", "group1-shard19of76.bin", "group1-shard20of76.bin", "group1-shard21of76.bin", "group1-shard22of76.bin", "group1-shard23of76.bin", "group1-shard24of76.bin", "group1-shard25of76.bin", "group1-shard26of76.bin", "group1-shard27of76.bin", "group1-shard28of76.bin", "group1-shard29of76.bin", "group1-shard30of76.bin", "group1-shard31of76.bin", "group1-shard32of76.bin", "group1-shard33of76.bin", "group1-shard34of76.bin", "group1-shard35of76.bin", "group1-shard36of76.bin", "group1-shard37of76.bin", "group1-shard38of76.bin", "group1-shard39of76.bin", "group1-shard40of76.bin", "group1-shard41of76.bin", "group1-shard42of76.bin", "group1-shard43of76.bin", "group1-shard44of76.bin", "group1-shard45of76.bin", "group1-shard46of76.bin", "group1-shard47of76.bin", "group1-shard48of76.bin", "group1-shard49of76.bin", "group1-shard50of76.bin", "group1-shard51of76.bin", "group1-shard52of76.bin", "group1-shard53of76.bin", "group1-shard54of76.bin", "group1-shard55of76.bin", "group1-shard56of76.bin", "group1-shard57of76.bin", "group1-shard58of76.bin", "group1-shard59of76.bin", "group1-shard60of76.bin", "group1-shard61of76.bin", "group1-shard62of76.bin", "group1-shard63of76.bin", "group1-shard64of76.bin", "group1-shard65of76.bin", "group1-shard66of76.bin", "group1-shard67of76.bin", "group1-shard68of76.bin", "group1-shard69of76.bin", "group1-shard70of76.bin", "group1-shard71of76.bin", "group1-shard72of76.bin", "group1-shard73of76.bin", "group1-shard74of76.bin", "group1-shard75of76.bin", "group1-shard76of76.bin"], "weights": [{"name": "ED/kernel", "shape": [1, 1, 1, 1, 8], "dtype": "float32"}, {"name": "ED/bias", "shape": [1], "dtype": "float32"}, {"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_transpose/kernel", "shape": [4, 4, 4, 512, 2048], "dtype": "float32"}, {"name": "conv3d_transpose/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3d_transpose_1/kernel", "shape": [4, 4, 4, 128, 512], "dtype": "float32"}, {"name": "conv3d_transpose_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_transpose_2/kernel", "shape": [4, 4, 4, 32, 128], "dtype": "float32"}, {"name": "conv3d_transpose_2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3d_transpose_3/kernel", "shape": [4, 4, 4, 8, 32], "dtype": "float32"}, {"name": "conv3d_transpose_3/bias", "shape": [8], "dtype": "float32"}, {"name": "encoder_conv2D1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "encoder_conv2D1/bias", "shape": [512], "dtype": "float32"}, {"name": "encoder_conv2D2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "encoder_conv2D2/bias", "shape": [512], "dtype": "float32"}, {"name": "encoder_conv2D3/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "encoder_conv2D3/bias", "shape": [256], "dtype": "float32"}]}]}